user_input = input("Введи ціле число:")
# конвертуємо введене значення в ціле число
numbers = int(user_input)
# якщо число більще 9 множимо всі його цифри
while numbers > 9:
    product = 1
    # витягуємо кожну цифру числа і перемножуємо
    while numbers > 0:
        digit = numbers % 10  # отримуємо останню цифру числа
        product *= digit  # перемножуємо цифру з поточним добутком
        numbers //= 10  # взнаходимо число що залишилось, щоб продовжити ітерацію
    numbers = product  # присвоюємо резьтату номер, щоб продовжити ітерацію поки число не буде <=9
print("result:", numbers)
